results/axum_heavy_20251009_071149/wrk_output.txt
Running 30s test @ http://127.0.0.1:8081/heavy
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   308.77ms  125.89ms 953.21ms   70.09%
    Req/Sec    80.97     24.58   171.00     69.13%
  Latency Distribution
     50%  302.92ms
     75%  386.52ms
     90%  466.34ms
     99%  641.78ms
  9694 requests in 30.03s, 12.00GB read
Requests/sec:    322.80
Transfer/sec:    409.12MB